pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_used_routines.h
//-----------------------------------------------------------------------------*
//                                                                             *
//                        File 'pic18_used_routines.h'                         *
//                         Generated by version 2.6.0                          *
//                        july 6th, 2014, at 14h44'38"                         *
//                                                                             *
//-----------------------------------------------------------------------------*

//--- START OF USER ZONE 1


//--- END OF USER ZONE 1

#ifndef pic18_used_routines_ENTITIES_DEFINED
#define pic18_used_routines_ENTITIES_DEFINED

//-----------------------------------------------------------------------------*

#include "galgas2/predefined-types.h"

//-----------------------------------------------------------------------------*

#include "pic18_metamodel.h"
#include "generic_metamodel.h"

//-----------------------------------------------------------------------------*


//-----------------------------------------------------------------------------*
//                                                                             *
//              Routine 'addPic18UsedRoutinesFromInstructionList'              *
//                                                                             *
//-----------------------------------------------------------------------------*

void routine_addPic_31__38_UsedRoutinesFromInstructionList (const GALGAS_pic_31__38_InstructionList constinArgument0,
                                                            GALGAS_stringset & ioArgument1,
                                                            C_Compiler * inCompiler
                                                            COMMA_LOCATION_ARGS) ;

//-----------------------------------------------------------------------------*
//                                                                             *
//                    Function 'pic18_computeUsedRoutines'                     *
//                                                                             *
//-----------------------------------------------------------------------------*

GALGAS_stringset function_pic_31__38__5F_computeUsedRoutines (const GALGAS_pic_31__38_InterruptDefinitionList & constinArgument0,
                                                              const GALGAS_pic_31__38_RoutineDefinitionList & constinArgument1,
                                                              const GALGAS_routineDeclarationList & constinArgument2,
                                                              const GALGAS_routineDeclarationList & constinArgument3,
                                                              C_Compiler * inCompiler
                                                              COMMA_LOCATION_ARGS) ;

//-----------------------------------------------------------------------------*
//                                                                             *
//     Abstract category method '@pic18PiccoloInstruction addUsedRoutines'     *
//                                                                             *
//-----------------------------------------------------------------------------*

typedef void (*categoryMethodSignature_pic_31__38_PiccoloInstruction_addUsedRoutines) (const cPtr_pic_31__38_PiccoloInstruction * inObject,
                                                                                       GALGAS_stringset & ioArgument0,
                                                                                       C_Compiler * inCompiler
                                                                                       COMMA_LOCATION_ARGS) ;

//-----------------------------------------------------------------------------*

void enterCategoryMethod_addUsedRoutines (const int32_t inClassIndex,
                                          categoryMethodSignature_pic_31__38_PiccoloInstruction_addUsedRoutines inMethod) ;

//-----------------------------------------------------------------------------*

void callCategoryMethod_addUsedRoutines (const cPtr_pic_31__38_PiccoloInstruction * inObject,
                                         GALGAS_stringset & io_ioUsedRoutines,
                                         C_Compiler * inCompiler
                                         COMMA_LOCATION_ARGS) ;

//--- START OF USER ZONE 2


//--- END OF USER ZONE 2

#endif
